artillery.yaml
config:
  target: http://localhost:5000
  phases:
    - duration: 30
      arrivalRate: 10
      name: Warmup
    - duration: 60
      arrivalRate: 10
      rampTo: 30
      name: Ramp up load
    - duration: 60
      arrivalRate: 30
      name: Sustained load
scenarios:
  - flow:
      - get:
          url: "/"